export const dataInfoCoursFront = [
  {
    id: 1,
    title: 'Для новичков',
    description:
      'Учитесь программированию с нуля — без технического бэкграунда и специальной подготовки.',
  },

  {
    id: 2,
    title: 'Для верстальщиков',
    description: 'Освойте JavaScript и React, чтобы браться за более сложные задачи.',
  },

  {
    id: 3,
    title: 'Кто сейчас не работает',
    description:
      'Получите новую специальность в сжатые сроки, уделяя учебе каждый день по несколько часов.',
  },
];

export const dataInfoLearnFront = [
  {
    id: 1,
    title: 'Качественно верстать сайты',
    description:
      ' Узнаете, как разрабатывать сайты с помощью HTML и CSS для всех актуальных версий браузеров и платформ.',
  },

  {
    id: 2,
    title: 'Разрабатывать интерактивные сайты',
    description:
      'Научитесь делать сложную анимацию, слайдеры, попап-окна, выпадающее меню с помощью JavaScript.',
  },

  {
    id: 3,
    title: 'Программировать на NodeJS',
    description:
      'Сможете создавать сайты и веб-приложения повышенной сложности, обрабатывать пользовательские функции и работать с файлами.',
  },
];

export const dataSpecialist = [
  {
    id: 1,
    img: '/Ellipse.svg',
    text: 'Ипотека со ставкой 5%',
  },

  {
    id: 2,
    img: '/Ellipse.svg',
    text: 'Отсрочка от призыва до 31 года',
  },

  {
    id: 3,
    img: '/Ellipse.svg',
    text: 'Отсрочка от частичной мобилизации',
  },
];

export const dataInfoPrice = [
  {
    id: 1,
    title: 'Базовый',
    manu: {},
  },
];

export const dataInfoLearnBack = [
  {
    id: 1,
    img: '/money-bag.svg',
    title: 'Нужен везде',
    description:
      'Язык C# входит в топ-5 самых востребованных языков программирования (TIOBE). Специалисты по C# и .NET нужны в крупных IT-компаниях',
  },

  {
    id: 2,
    img: '/beach-holiday.svg',
    title: 'Простой',
    description:
      'Невысокий порог входа: C# не уступает по мощности языку программирования Java. Освоить C# с нуля до уровня Pro намного проще',
  },
];

export const dataInfoCoursBack = [
  {
    id: 1,
    img: '/line-presentation.svg',
    title: 'Для программистов',
    description:
      'Используйте функциональный #C для проектов и выйдите на новый уровень в карьере и доходе.',
  },

  {
    id: 2,
    img: '/computer-monitor.svg',
    title: 'Кто хочет работать в IT',
    description:
      'Освойте с нуля #C — один из самых высокооплачиваемых и быстрорастущих языков программирования.',
  },
];

export const dataInfoProgramCoursFront = [
  {
    id: 1,
    title: 'Верстка и css',
    text1:
      'Без знания верстки разработчику не обойтись. HTML и CSS нужны даже для простеньких сайтов.',
    text2:
      'В этом блоке вы узнаете, как создавать адаптируемые страницы для разных устройств. И уже через месяц обучения сможете брать маленькие заказы на биржах.',
    subtitle: 'Вы научитесь:',
    menu: [
      '— Выстраивать внешнюю логику сайта',
      '— Писать страницы на чистом HTML',
      '— Позиционировать элементы на странице с помощью CSS',
      ' — Создавать логичную и последовательную иерархию страниц при помощи семантическойверстки',
      '— Использовать Google DevTools, средства разработчика в браузере',
      '— Верстать адаптивные веб-страницы на Flexbox',
      '— Работать в GitHub',
    ],
  },

  {
    id: 2,
    title: 'Нативный JavaScript ',
    text1:
      'JavaScript — популярный язык для создания фронтенда. Это клиентская часть сайтов, которая видна пользователям.',
    text2: 'Вы будете программировать на JavaScript и с его помощью решать конкретные задачи.',
    subtitle: 'Вы научитесь:',
    menu: [
      '— Использовать объекты и EventLoop',
      '— Создавать сложные скрипты с обработкой событий',
      '— Работать с форматом JSON',
      ' — Использовать препроцессоры CSS',
      '— Работать по методологии БЭМ',
      '— Применять сборщики (Webpack)',
      '— Работать в GitHub',
    ],
  },

  {
    id: 3,
    title: 'Разработка с помощью React. js ',
    text1:
      'Освойте набор библиотек React. С его помощью можно управлять сложными событиями, создавать модульные проекты и добавлять анимацию на страницы сайта. ',
    text2:
      'Более того, изучение React позволяет освоить другие фреймворки — например, Angular и Vue.js. Это расширит ваши возможности по выбору проектов.',
    subtitle: 'Вы научитесь:',
    menu: [
      '— Разрабатывать приложения на React',
      '— Писать компоненты на React',
      '— Использовать продвинутый API',
      '— Создавать приложение на Angular',
      '— Работать по методологии БЭМ',
      '— Применять сборщики (Webpack)',
      '— Работать в GitHub',
    ],
  },

  {
    id: 4,
    title: 'Архитектура приложений и работа с запросами на сервер',
    text1:
      'Если верстальщик отвечает за компоновку макета, то разработчик должен понимать, как все устроено изнутри. ',
    text2:
      'В этом блоке вы познакомитесь с серверной частью веб-сайтов — бэкендом. А еще поработаете с API и узнаете, как использовать Node.js.',
    subtitle: 'Вы научитесь:',
    menu: [
      '— Подключать приложение к базе данных',
      '— Разворачивать приложение на Node. js',
      '— Писать unit-тесты для проверки небольшой части кода',
      '— Писать запросы на сервер',
      '— Работать с вебсокитами',
    ],
  },
];

export const dataInfoProgramCoursBack = [
  {
    id: 1,
    title: 'Программирование на C#',
    text1:
      'Начало изучения языка C# - вы уже сможете написать своего телеграм-бота и разработаете свой первый проект - текстовую версию социальной сети.',
    text2:
      'Обязательно научитесь применять объектно-ориентированное программирование на C#, потому что это важно для больших проектов. Сразу получаете опыт работы с GitHub и сохраняете там все свои проекты.',
    subtitle: 'Вы научитесь:',
    menu: [
      '— Основы языка C#',
      '— ООП: наследование, инкапсуляция, полиморфизм',
      '— Классы и объекты',
      '— Реализация интерфейсов',
      '— Обработка исключений',
      '— Коллекции C#',
      '— Основы LINQ',
      '— Паттерны проектирования (SOLID)',
    ],
  },

  {
    id: 2,
    title: 'Backend-разработка на C#',
    text1:
      'Бекенд - это сердце сайта, то есть основная программа, которая работает на сервере. Чтобы создать бекенд, нужно знать базы данных.',
    text2: 'Вы изучите базы данных SQL, научитесь разрабатывать бекенд на ADO.NET.',
    subtitle: 'Вы научитесь:',
    menu: [
      '— Основы SQL и реляционных баз данных',
      '— Функции, операторы и типы данных в SQL',
      '— Проектирование базы данных',
      ' — Работа с ADO.NET',
      '— Использование Entity Framework Core для CRUD-операций',
      '— Многопоточность и асинхронность',
      '— Работать в GitHub',
    ],
  },

  {
    id: 3,
    title: 'Веб-разработка ASP.NET Core',
    text1:
      'Освойте набор библиотек React. С его помощью можно управлять сложными событиями, создавать модульные проекты и добавлять анимацию на страницы сайта. ',
    text2:
      'Более того, изучение React позволяет освоить другие фреймворки — например, Angular и Vue.js. Это расширит ваши возможности по выбору проектов.',
    subtitle: 'Вы научитесь:',
    menu: [
      '— HTML/CSS',
      '— Основы JavaScript, DOM-модель',
      '— Разработка в ASP.NET Core',
      '— Создание Web API',
    ],
  },

  {
    id: 4,
    title: 'Десктоп и мобильная разработка',
    text1:
      'Сила C# и NET CORE в кроссплатформенности - можно делать и сайты, и десктоп-программы, и мобильные приложения.',
    text2:
      'Чтобы максимально прокачать свои навыки, вы научитесь работать в Windows Presentation Foundation и разрабатывать десктоп-приложения. Изучите платформу Xamarin и сможете создавать приложения для Android и iOS.',
    subtitle: 'Вы научитесь:',
    menu: [
      '— Создание приложения в WPF',
      '— Основы XAML',
      '— Работа в Xamarin, интерфейс и отображение данных',
    ],
  },
];

export const dataInfoBaseFront = [
  {
    id: 1,
    title: 'Frontend- разработчик с нуля до Джуна',
    description: [
      'Научитесь создавать сайты и приложения, проектировать интерфейсы и работать с Flexbox и JavaScript',
      'Соберите портфолио из 5 проектов',
      'Начните работать по специальности через 6 месяцев обучения',
    ],
  },
];

export const dataInfoBaseBack = [
  {
    id: 1,
    title: 'Backend-разработчик на #C',
    description: [
      'Научитесь создавать сайты и приложения, проектировать интерфейсы и работать с Flexbox и JavaScript',
      'Соберите портфолио из 5 проектов',
      'Начните работать по специальности через 6 месяцев обучения',
    ],
  },
];

export const dataBriefCours = [
  {
    id: 1,
    start: '7 ноября 2024 год - 5 июня 2025 год',
    duration: '12 месяцев',
    formatStudy: 'Вебинары, видеолекции, практические задания',
  },
];

export const dataInfoQuestions = [
  {
    id: 1,
    title: 'Backend-разработчик на #C',
    questions: [
      'Всем, что связано с компьютерами',
      'Вопросами лидерства и психологией',
      'Рекламой, маркетингом, бизнесом',
      'Мастерить что-то красивое или полезное',
    ],
  },
  {
    id: 2,
    title: 'Какой язык разработки более близок вам?',
    questions: ['JavaScript', '#c', 'Node js', 'Python'],
  },
  {
    id: 3,
    title: 'Мне больше подходит?',
    questions: [
      'Делать свою работу независимо от других людей',
      'Управлять людьми, организовывать их работу',
      'Работать в команде, в сотрудничестве с другими людьми',
      'Мастерить что-то красивое или полезное',
    ],
  },
  {
    id: 4,
    title: 'Для меня более комфортно?',
    questions: [
      'Концентрироваться на одном деле, не отвлекаясь',
      'Делать несколько дел одновременно',
      'Переключаться на разные задачи, чтобы не заскучать',
    ],
  },
  {
    id: 5,
    title: 'Мне больше подходит?',
    questions: [
      'Постоянная работа на полную занятость в конкретной компании',
      'Самостоятельная (индивидуальная) работа "на себя"',
      'Проектная занятость, можно в команде, но без привязки к конкретной компании',
    ],
  },
  {
    id: 6,
    title: 'В свободное время я предпочту?',
    questions: [
      'Играть в компьютерные игры',
      'Общаться в соцсетях (писать посты, размещать фото)',
      'Мастерить что-то красивое или полезное',
      'Заниматься саморазвитием',
    ],
  },
  {
    id: 7,
    title:
      'Во время учебы в школе у меня в большей степени проявлялись способности из перечисленных?',
    questions: [
      'Рисованию, прикладному творчеству',
      'Точным наукам (информатика, математика, физика, химия)',
      'Музыке, пению или диджеингу (создание музыкальных сетов)',
      'Изучению языков, литературе, словесному творчеству',
    ],
  },
  {
    id: 8,
    title: 'Мне больше нравится?',
    questions: [
      'Решать задачи, где нужно поразмышлять, "поломать" голову',
      'Придумывать что-то новое, экспериментировать',
      'Исследовать, анализировать, "раскладывать по полочкам"',
    ],
  },
  {
    id: 9,
    title: 'Я лучше воспринимаю и запоминаю информацию?',
    questions: [
      'На слух',
      'С помощью картинок и образов',
      'Чтобы лучше запомнить, мне нужно понять логику, разобраться',
    ],
  },
  {
    id: 10,
    title: 'Я лучше справляюсь с задачами, которые требуют?',
    questions: [
      'Концентрации, вдумчивости',
      'Гибкости, хорошего понимания потребностей заказчика',
      'Инициативы, самостоятельного принятия решений',
    ],
  },
  // {
  //   id: 10,
  //   title: 'Я лучше справляюсь с задачами, которые требуют?',
  //   questions: [
  //     'Концентрации, вдумчивости',
  //     'Гибкости, хорошего понимания потребностей заказчика',
  //     'Инициативы, самостоятельного принятия решений',
  //   ],
  // },
];
